RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sf_ctrl_reg.h
/* 0xC8 : sf_if2_sahb_0 */
#define SF_CTRL_SF_IF2_SAHB_0_OFFSET      (0xC8)
#define SF_CTRL_SF_IF2_BUSY               SF_CTRL_SF_IF2_BUSY
#define SF_CTRL_SF_IF2_BUSY_POS           (0U)
#define SF_CTRL_SF_IF2_BUSY_LEN           (1U)
#define SF_CTRL_SF_IF2_BUSY_MSK           (((1U << SF_CTRL_SF_IF2_BUSY_LEN) - 1) << SF_CTRL_SF_IF2_BUSY_POS)
#define SF_CTRL_SF_IF2_BUSY_UMSK          (~(((1U << SF_CTRL_SF_IF2_BUSY_LEN) - 1) << SF_CTRL_SF_IF2_BUSY_POS))
#define SF_CTRL_SF_IF2_0_TRIG             SF_CTRL_SF_IF2_0_TRIG
#define SF_CTRL_SF_IF2_0_TRIG_POS         (1U)
#define SF_CTRL_SF_IF2_0_TRIG_LEN         (1U)
#define SF_CTRL_SF_IF2_0_TRIG_MSK         (((1U << SF_CTRL_SF_IF2_0_TRIG_LEN) - 1) << SF_CTRL_SF_IF2_0_TRIG_POS)
#define SF_CTRL_SF_IF2_0_TRIG_UMSK        (~(((1U << SF_CTRL_SF_IF2_0_TRIG_LEN) - 1) << SF_CTRL_SF_IF2_0_TRIG_POS))
#define SF_CTRL_SF_IF2_0_DAT_BYTE         SF_CTRL_SF_IF2_0_DAT_BYTE
#define SF_CTRL_SF_IF2_0_DAT_BYTE_POS     (2U)
#define SF_CTRL_SF_IF2_0_DAT_BYTE_LEN     (10U)
#define SF_CTRL_SF_IF2_0_DAT_BYTE_MSK     (((1U << SF_CTRL_SF_IF2_0_DAT_BYTE_LEN) - 1) << SF_CTRL_SF_IF2_0_DAT_BYTE_POS)
#define SF_CTRL_SF_IF2_0_DAT_BYTE_UMSK    (~(((1U << SF_CTRL_SF_IF2_0_DAT_BYTE_LEN) - 1) << SF_CTRL_SF_IF2_0_DAT_BYTE_POS))
#define SF_CTRL_SF_IF2_0_DMY_BYTE         SF_CTRL_SF_IF2_0_DMY_BYTE
#define SF_CTRL_SF_IF2_0_DMY_BYTE_POS     (12U)
#define SF_CTRL_SF_IF2_0_DMY_BYTE_LEN     (5U)
#define SF_CTRL_SF_IF2_0_DMY_BYTE_MSK     (((1U << SF_CTRL_SF_IF2_0_DMY_BYTE_LEN) - 1) << SF_CTRL_SF_IF2_0_DMY_BYTE_POS)
#define SF_CTRL_SF_IF2_0_DMY_BYTE_UMSK    (~(((1U << SF_CTRL_SF_IF2_0_DMY_BYTE_LEN) - 1) << SF_CTRL_SF_IF2_0_DMY_BYTE_POS))
#define SF_CTRL_SF_IF2_0_ADR_BYTE         SF_CTRL_SF_IF2_0_ADR_BYTE
#define SF_CTRL_SF_IF2_0_ADR_BYTE_POS     (17U)
#define SF_CTRL_SF_IF2_0_ADR_BYTE_LEN     (3U)
#define SF_CTRL_SF_IF2_0_ADR_BYTE_MSK     (((1U << SF_CTRL_SF_IF2_0_ADR_BYTE_LEN) - 1) << SF_CTRL_SF_IF2_0_ADR_BYTE_POS)
#define SF_CTRL_SF_IF2_0_ADR_BYTE_UMSK    (~(((1U << SF_CTRL_SF_IF2_0_ADR_BYTE_LEN) - 1) << SF_CTRL_SF_IF2_0_ADR_BYTE_POS))
#define SF_CTRL_SF_IF2_0_CMD_BYTE         SF_CTRL_SF_IF2_0_CMD_BYTE
#define SF_CTRL_SF_IF2_0_CMD_BYTE_POS     (20U)
#define SF_CTRL_SF_IF2_0_CMD_BYTE_LEN     (3U)
#define SF_CTRL_SF_IF2_0_CMD_BYTE_MSK     (((1U << SF_CTRL_SF_IF2_0_CMD_BYTE_LEN) - 1) << SF_CTRL_SF_IF2_0_CMD_BYTE_POS)
#define SF_CTRL_SF_IF2_0_CMD_BYTE_UMSK    (~(((1U << SF_CTRL_SF_IF2_0_CMD_BYTE_LEN) - 1) << SF_CTRL_SF_IF2_0_CMD_BYTE_POS))
#define SF_CTRL_SF_IF2_0_DAT_RW           SF_CTRL_SF_IF2_0_DAT_RW
#define SF_CTRL_SF_IF2_0_DAT_RW_POS       (23U)
#define SF_CTRL_SF_IF2_0_DAT_RW_LEN       (1U)
#define SF_CTRL_SF_IF2_0_DAT_RW_MSK       (((1U << SF_CTRL_SF_IF2_0_DAT_RW_LEN) - 1) << SF_CTRL_SF_IF2_0_DAT_RW_POS)
#define SF_CTRL_SF_IF2_0_DAT_RW_UMSK      (~(((1U << SF_CTRL_SF_IF2_0_DAT_RW_LEN) - 1) << SF_CTRL_SF_IF2_0_DAT_RW_POS))
#define SF_CTRL_SF_IF2_0_DAT_EN           SF_CTRL_SF_IF2_0_DAT_EN
#define SF_CTRL_SF_IF2_0_DAT_EN_POS       (24U)
#define SF_CTRL_SF_IF2_0_DAT_EN_LEN       (1U)
#define SF_CTRL_SF_IF2_0_DAT_EN_MSK       (((1U << SF_CTRL_SF_IF2_0_DAT_EN_LEN) - 1) << SF_CTRL_SF_IF2_0_DAT_EN_POS)
#define SF_CTRL_SF_IF2_0_DAT_EN_UMSK      (~(((1U << SF_CTRL_SF_IF2_0_DAT_EN_LEN) - 1) << SF_CTRL_SF_IF2_0_DAT_EN_POS))
#define SF_CTRL_SF_IF2_0_DMY_EN           SF_CTRL_SF_IF2_0_DMY_EN
#define SF_CTRL_SF_IF2_0_DMY_EN_POS       (25U)
#define SF_CTRL_SF_IF2_0_DMY_EN_LEN       (1U)
#define SF_CTRL_SF_IF2_0_DMY_EN_MSK       (((1U << SF_CTRL_SF_IF2_0_DMY_EN_LEN) - 1) << SF_CTRL_SF_IF2_0_DMY_EN_POS)
#define SF_CTRL_SF_IF2_0_DMY_EN_UMSK      (~(((1U << SF_CTRL_SF_IF2_0_DMY_EN_LEN) - 1) << SF_CTRL_SF_IF2_0_DMY_EN_POS))
#define SF_CTRL_SF_IF2_0_ADR_EN           SF_CTRL_SF_IF2_0_ADR_EN
#define SF_CTRL_SF_IF2_0_ADR_EN_POS       (26U)
#define SF_CTRL_SF_IF2_0_ADR_EN_LEN       (1U)
#define SF_CTRL_SF_IF2_0_ADR_EN_MSK       (((1U << SF_CTRL_SF_IF2_0_ADR_EN_LEN) - 1) << SF_CTRL_SF_IF2_0_ADR_EN_POS)
#define SF_CTRL_SF_IF2_0_ADR_EN_UMSK      (~(((1U << SF_CTRL_SF_IF2_0_ADR_EN_LEN) - 1) << SF_CTRL_SF_IF2_0_ADR_EN_POS))
#define SF_CTRL_SF_IF2_0_CMD_EN           SF_CTRL_SF_IF2_0_CMD_EN
#define SF_CTRL_SF_IF2_0_CMD_EN_POS       (27U)
#define SF_CTRL_SF_IF2_0_CMD_EN_LEN       (1U)
#define SF_CTRL_SF_IF2_0_CMD_EN_MSK       (((1U << SF_CTRL_SF_IF2_0_CMD_EN_LEN) - 1) << SF_CTRL_SF_IF2_0_CMD_EN_POS)
#define SF_CTRL_SF_IF2_0_CMD_EN_UMSK      (~(((1U << SF_CTRL_SF_IF2_0_CMD_EN_LEN) - 1) << SF_CTRL_SF_IF2_0_CMD_EN_POS))
#define SF_CTRL_SF_IF2_0_SPI_MODE         SF_CTRL_SF_IF2_0_SPI_MODE
#define SF_CTRL_SF_IF2_0_SPI_MODE_POS     (28U)
#define SF_CTRL_SF_IF2_0_SPI_MODE_LEN     (3U)
#define SF_CTRL_SF_IF2_0_SPI_MODE_MSK     (((1U << SF_CTRL_SF_IF2_0_SPI_MODE_LEN) - 1) << SF_CTRL_SF_IF2_0_SPI_MODE_POS)
#define SF_CTRL_SF_IF2_0_SPI_MODE_UMSK    (~(((1U << SF_CTRL_SF_IF2_0_SPI_MODE_LEN) - 1) << SF_CTRL_SF_IF2_0_SPI_MODE_POS))
#define SF_CTRL_SF_IF2_0_QPI_MODE_EN      SF_CTRL_SF_IF2_0_QPI_MODE_EN
#define SF_CTRL_SF_IF2_0_QPI_MODE_EN_POS  (31U)
#define SF_CTRL_SF_IF2_0_QPI_MODE_EN_LEN  (1U)
#define SF_CTRL_SF_IF2_0_QPI_MODE_EN_MSK  (((1U << SF_CTRL_SF_IF2_0_QPI_MODE_EN_LEN) - 1) << SF_CTRL_SF_IF2_0_QPI_MODE_EN_POS)
#define SF_CTRL_SF_IF2_0_QPI_MODE_EN_UMSK (~(((1U << SF_CTRL_SF_IF2_0_QPI_MODE_EN_LEN) - 1) << SF_CTRL_SF_IF2_0_QPI_MODE_EN_POS))

/* 0xCC : sf_if2_sahb_1 */
#define SF_CTRL_SF_IF2_SAHB_1_OFFSET    (0xCC)
#define SF_CTRL_SF_IF2_0_CMD_BUF_0      SF_CTRL_SF_IF2_0_CMD_BUF_0
#define SF_CTRL_SF_IF2_0_CMD_BUF_0_POS  (0U)
#define SF_CTRL_SF_IF2_0_CMD_BUF_0_LEN  (32U)
#define SF_CTRL_SF_IF2_0_CMD_BUF_0_MSK  (((1U << SF_CTRL_SF_IF2_0_CMD_BUF_0_LEN) - 1) << SF_CTRL_SF_IF2_0_CMD_BUF_0_POS)
#define SF_CTRL_SF_IF2_0_CMD_BUF_0_UMSK (~(((1U << SF_CTRL_SF_IF2_0_CMD_BUF_0_LEN) - 1) << SF_CTRL_SF_IF2_0_CMD_BUF_0_POS))

/* 0xD0 : sf_if2_sahb_2 */
#define SF_CTRL_SF_IF2_SAHB_2_OFFSET    (0xD0)
#define SF_CTRL_SF_IF2_0_CMD_BUF_1      SF_CTRL_SF_IF2_0_CMD_BUF_1
#define SF_CTRL_SF_IF2_0_CMD_BUF_1_POS  (0U)
#define SF_CTRL_SF_IF2_0_CMD_BUF_1_LEN  (32U)
#define SF_CTRL_SF_IF2_0_CMD_BUF_1_MSK  (((1U << SF_CTRL_SF_IF2_0_CMD_BUF_1_LEN) - 1) << SF_CTRL_SF_IF2_0_CMD_BUF_1_POS)
#define SF_CTRL_SF_IF2_0_CMD_BUF_1_UMSK (~(((1U << SF_CTRL_SF_IF2_0_CMD_BUF_1_LEN) - 1) << SF_CTRL_SF_IF2_0_CMD_BUF_1_POS))

/* 0x100 : sf_ctrl_prot_en_rd */
#define SF_CTRL_PROT_EN_RD_OFFSET          (0x100)
#define SF_CTRL_ID0_EN_RD                  SF_CTRL_ID0_EN_RD
#define SF_CTRL_ID0_EN_RD_POS              (1U)
#define SF_CTRL_ID0_EN_RD_LEN              (1U)
#define SF_CTRL_ID0_EN_RD_MSK              (((1U << SF_CTRL_ID0_EN_RD_LEN) - 1) << SF_CTRL_ID0_EN_RD_POS)
#define SF_CTRL_ID0_EN_RD_UMSK             (~(((1U << SF_CTRL_ID0_EN_RD_LEN) - 1) << SF_CTRL_ID0_EN_RD_POS))
#define SF_CTRL_ID1_EN_RD                  SF_CTRL_ID1_EN_RD
#define SF_CTRL_ID1_EN_RD_POS              (2U)
#define SF_CTRL_ID1_EN_RD_LEN              (1U)
#define SF_CTRL_ID1_EN_RD_MSK              (((1U << SF_CTRL_ID1_EN_RD_LEN) - 1) << SF_CTRL_ID1_EN_RD_POS)
#define SF_CTRL_ID1_EN_RD_UMSK             (~(((1U << SF_CTRL_ID1_EN_RD_LEN) - 1) << SF_CTRL_ID1_EN_RD_POS))
#define SF_CTRL_SF_SEC_TZSID_LOCK          SF_CTRL_SF_SEC_TZSID_LOCK
#define SF_CTRL_SF_SEC_TZSID_LOCK_POS      (28U)
#define SF_CTRL_SF_SEC_TZSID_LOCK_LEN      (1U)
#define SF_CTRL_SF_SEC_TZSID_LOCK_MSK      (((1U << SF_CTRL_SF_SEC_TZSID_LOCK_LEN) - 1) << SF_CTRL_SF_SEC_TZSID_LOCK_POS)
#define SF_CTRL_SF_SEC_TZSID_LOCK_UMSK     (~(((1U << SF_CTRL_SF_SEC_TZSID_LOCK_LEN) - 1) << SF_CTRL_SF_SEC_TZSID_LOCK_POS))
#define SF_CTRL_SF_IF2_0_TRIG_WR_LOCK      SF_CTRL_SF_IF2_0_TRIG_WR_LOCK
#define SF_CTRL_SF_IF2_0_TRIG_WR_LOCK_POS  (29U)
#define SF_CTRL_SF_IF2_0_TRIG_WR_LOCK_LEN  (1U)
#define SF_CTRL_SF_IF2_0_TRIG_WR_LOCK_MSK  (((1U << SF_CTRL_SF_IF2_0_TRIG_WR_LOCK_LEN) - 1) << SF_CTRL_SF_IF2_0_TRIG_WR_LOCK_POS)
#define SF_CTRL_SF_IF2_0_TRIG_WR_LOCK_UMSK (~(((1U << SF_CTRL_SF_IF2_0_TRIG_WR_LOCK_LEN) - 1) << SF_CTRL_SF_IF2_0_TRIG_WR_LOCK_POS))
#define SF_CTRL_SF_IF_0_TRIG_WR_LOCK       SF_CTRL_SF_IF_0_TRIG_WR_LOCK
#define SF_CTRL_SF_IF_0_TRIG_WR_LOCK_POS   (30U)
#define SF_CTRL_SF_IF_0_TRIG_WR_LOCK_LEN   (1U)
#define SF_CTRL_SF_IF_0_TRIG_WR_LOCK_MSK   (((1U << SF_CTRL_SF_IF_0_TRIG_WR_LOCK_LEN) - 1) << SF_CTRL_SF_IF_0_TRIG_WR_LOCK_POS)
#define SF_CTRL_SF_IF_0_TRIG_WR_LOCK_UMSK  (~(((1U << SF_CTRL_SF_IF_0_TRIG_WR_LOCK_LEN) - 1) << SF_CTRL_SF_IF_0_TRIG_WR_LOCK_POS))
#define SF_CTRL_SF_DBG_DIS                 SF_CTRL_SF_DBG_DIS
#define SF_CTRL_SF_DBG_DIS_POS             (31U)
#define SF_CTRL_SF_DBG_DIS_LEN             (1U)
#define SF_CTRL_SF_DBG_DIS_MSK             (((1U << SF_CTRL_SF_DBG_DIS_LEN) - 1) << SF_CTRL_SF_DBG_DIS_POS)
#define SF_CTRL_SF_DBG_DIS_UMSK            (~(((1U << SF_CTRL_SF_DBG_DIS_LEN) - 1) << SF_CTRL_SF_DBG_DIS_POS))

/* 0x104 : sf_ctrl_prot_en */
#define SF_CTRL_PROT_EN_OFFSET (0x104)
#define SF_CTRL_ID0_EN         SF_CTRL_ID0_EN
#define SF_CTRL_ID0_EN_POS     (1U)
#define SF_CTRL_ID0_EN_LEN     (1U)
#define SF_CTRL_ID0_EN_MSK     (((1U << SF_CTRL_ID0_EN_LEN) - 1) << SF_CTRL_ID0_EN_POS)
#define SF_CTRL_ID0_EN_UMSK    (~(((1U << SF_CTRL_ID0_EN_LEN) - 1) << SF_CTRL_ID0_EN_POS))
#define SF_CTRL_ID1_EN         SF_CTRL_ID1_EN
#define SF_CTRL_ID1_EN_POS     (2U)
#define SF_CTRL_ID1_EN_LEN     (1U)
#define SF_CTRL_ID1_EN_MSK     (((1U << SF_CTRL_ID1_EN_LEN) - 1) << SF_CTRL_ID1_EN_POS)
#define SF_CTRL_ID1_EN_UMSK    (~(((1U << SF_CTRL_ID1_EN_LEN) - 1) << SF_CTRL_ID1_EN_POS))

/* 0x200 : sf_aes_key_r0_0 */
#define SF_CTRL_SF_AES_KEY_R0_0_OFFSET (0x200)
#define SF_CTRL_SF_AES_KEY_R0_0        SF_CTRL_SF_AES_KEY_R0_0
#define SF_CTRL_SF_AES_KEY_R0_0_POS    (0U)
#define SF_CTRL_SF_AES_KEY_R0_0_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_R0_0_MSK    (((1U << SF_CTRL_SF_AES_KEY_R0_0_LEN) - 1) << SF_CTRL_SF_AES_KEY_R0_0_POS)
#define SF_CTRL_SF_AES_KEY_R0_0_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_R0_0_LEN) - 1) << SF_CTRL_SF_AES_KEY_R0_0_POS))

/* 0x204 : sf_aes_key_r0_1 */
#define SF_CTRL_SF_AES_KEY_R0_1_OFFSET (0x204)
#define SF_CTRL_SF_AES_KEY_R0_1        SF_CTRL_SF_AES_KEY_R0_1
#define SF_CTRL_SF_AES_KEY_R0_1_POS    (0U)
#define SF_CTRL_SF_AES_KEY_R0_1_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_R0_1_MSK    (((1U << SF_CTRL_SF_AES_KEY_R0_1_LEN) - 1) << SF_CTRL_SF_AES_KEY_R0_1_POS)
#define SF_CTRL_SF_AES_KEY_R0_1_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_R0_1_LEN) - 1) << SF_CTRL_SF_AES_KEY_R0_1_POS))

/* 0x208 : sf_aes_key_r0_2 */
#define SF_CTRL_SF_AES_KEY_R0_2_OFFSET (0x208)
#define SF_CTRL_SF_AES_KEY_R0_2        SF_CTRL_SF_AES_KEY_R0_2
#define SF_CTRL_SF_AES_KEY_R0_2_POS    (0U)
#define SF_CTRL_SF_AES_KEY_R0_2_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_R0_2_MSK    (((1U << SF_CTRL_SF_AES_KEY_R0_2_LEN) - 1) << SF_CTRL_SF_AES_KEY_R0_2_POS)
#define SF_CTRL_SF_AES_KEY_R0_2_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_R0_2_LEN) - 1) << SF_CTRL_SF_AES_KEY_R0_2_POS))

/* 0x20C : sf_aes_key_r0_3 */
#define SF_CTRL_SF_AES_KEY_R0_3_OFFSET (0x20C)
#define SF_CTRL_SF_AES_KEY_R0_3        SF_CTRL_SF_AES_KEY_R0_3
#define SF_CTRL_SF_AES_KEY_R0_3_POS    (0U)
#define SF_CTRL_SF_AES_KEY_R0_3_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_R0_3_MSK    (((1U << SF_CTRL_SF_AES_KEY_R0_3_LEN) - 1) << SF_CTRL_SF_AES_KEY_R0_3_POS)
#define SF_CTRL_SF_AES_KEY_R0_3_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_R0_3_LEN) - 1) << SF_CTRL_SF_AES_KEY_R0_3_POS))

/* 0x210 : sf_aes_key_r0_4 */
#define SF_CTRL_SF_AES_KEY_R0_4_OFFSET (0x210)
#define SF_CTRL_SF_AES_KEY_R0_4        SF_CTRL_SF_AES_KEY_R0_4
#define SF_CTRL_SF_AES_KEY_R0_4_POS    (0U)
#define SF_CTRL_SF_AES_KEY_R0_4_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_R0_4_MSK    (((1U << SF_CTRL_SF_AES_KEY_R0_4_LEN) - 1) << SF_CTRL_SF_AES_KEY_R0_4_POS)
#define SF_CTRL_SF_AES_KEY_R0_4_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_R0_4_LEN) - 1) << SF_CTRL_SF_AES_KEY_R0_4_POS))

