RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sf_ctrl_reg.h
    /* 0x38 : sf_if_io_dly_2 */
    union {
        struct {
            uint32_t sf_io_1_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7       : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf_io_1_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15     : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf_io_1_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31     : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_io_dly_2;

    /* 0x3C : sf_if_io_dly_3 */
    union {
        struct {
            uint32_t sf_io_2_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7       : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf_io_2_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15     : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf_io_2_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31     : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_io_dly_3;

    /* 0x40 : sf_if_io_dly_4 */
    union {
        struct {
            uint32_t sf_io_3_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7       : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf_io_3_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15     : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf_io_3_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31     : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_io_dly_4;

    /* 0x44 : sf_reserved */
    union {
        struct {
            uint32_t sf_reserved : 32; /* [31: 0],        r/w,     0xffff */
        } BF;
        uint32_t WORD;
    } sf_reserved;

    /* 0x48 : sf2_if_io_dly_0 */
    union {
        struct {
            uint32_t sf2_cs_dly_sel      : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t sf2_cs2_dly_sel     : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reserved_4_7        : 4;  /* [ 7: 4],       rsvd,        0x0 */
            uint32_t sf2_clk_out_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_25      : 16; /* [25:10],       rsvd,        0x0 */
            uint32_t sf2_dqs_oe_dly_sel  : 2;  /* [27:26],        r/w,        0x0 */
            uint32_t sf2_dqs_di_dly_sel  : 2;  /* [29:28],        r/w,        0x0 */
            uint32_t sf2_dqs_do_dly_sel  : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf2_if_io_dly_0;

    /* 0x4C : sf2_if_io_dly_1 */
    union {
        struct {
            uint32_t sf2_io_0_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7        : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf2_io_0_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15      : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf2_io_0_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31      : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf2_if_io_dly_1;

    /* 0x50 : sf2_if_io_dly_2 */
    union {
        struct {
            uint32_t sf2_io_1_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7        : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf2_io_1_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15      : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf2_io_1_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31      : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf2_if_io_dly_2;

    /* 0x54 : sf2_if_io_dly_3 */
    union {
        struct {
            uint32_t sf2_io_2_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7        : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf2_io_2_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15      : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf2_io_2_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31      : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf2_if_io_dly_3;

    /* 0x58 : sf2_if_io_dly_4 */
    union {
        struct {
            uint32_t sf2_io_3_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7        : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf2_io_3_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15      : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf2_io_3_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31      : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf2_if_io_dly_4;

    /* 0x5C : sf3_if_io_dly_0 */
    union {
        struct {
            uint32_t sf3_cs_dly_sel      : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t sf3_cs2_dly_sel     : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reserved_4_7        : 4;  /* [ 7: 4],       rsvd,        0x0 */
            uint32_t sf3_clk_out_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_25      : 16; /* [25:10],       rsvd,        0x0 */
            uint32_t sf3_dqs_oe_dly_sel  : 2;  /* [27:26],        r/w,        0x0 */
            uint32_t sf3_dqs_di_dly_sel  : 2;  /* [29:28],        r/w,        0x0 */
            uint32_t sf3_dqs_do_dly_sel  : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf3_if_io_dly_0;

    /* 0x60 : sf3_if_io_dly_1 */
    union {
        struct {
            uint32_t sf3_io_0_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7        : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf3_io_0_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15      : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf3_io_0_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31      : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf3_if_io_dly_1;

    /* 0x64 : sf3_if_io_dly_2 */
    union {
        struct {
            uint32_t sf3_io_1_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7        : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf3_io_1_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15      : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf3_io_1_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31      : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf3_if_io_dly_2;

