RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sf_ctrl_reg.h
    /* 0x68 : sf3_if_io_dly_3 */
    union {
        struct {
            uint32_t sf3_io_2_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7        : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf3_io_2_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15      : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf3_io_2_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31      : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf3_if_io_dly_3;

    /* 0x6C : sf3_if_io_dly_4 */
    union {
        struct {
            uint32_t sf3_io_3_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7        : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf3_io_3_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15      : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf3_io_3_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31      : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf3_if_io_dly_4;

    /* 0x70 : sf_ctrl_2 */
    union {
        struct {
            uint32_t sf_if_pad_sel         : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2            : 1;  /* [    2],       rsvd,        0x0 */
            uint32_t sf_if_pad_sel_lock    : 1;  /* [    3],        r/w,        0x0 */
            uint32_t sf_if_dtr_en          : 1;  /* [    4],        r/w,        0x0 */
            uint32_t sf_if_dqs_en          : 1;  /* [    5],        r/w,        0x0 */
            uint32_t sf_if_trig_wr_prot    : 1;  /* [    6],        r/w,        0x0 */
            uint32_t sf_id_offset_lock     : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_24         : 17; /* [24: 8],       rsvd,        0x0 */
            uint32_t sf_ahb2sif_remap_lock : 1;  /* [   25],        r/w,        0x0 */
            uint32_t sf_ahb2sif_remap      : 2;  /* [27:26],        r/w,        0x0 */
            uint32_t sf_if_bk_swap         : 1;  /* [   28],        r/w,        0x0 */
            uint32_t sf_if_bk2_mode        : 1;  /* [   29],        r/w,        0x0 */
            uint32_t sf_if_bk2_en          : 1;  /* [   30],        r/w,        0x0 */
            uint32_t sf_if_0_bk_sel        : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_ctrl_2;

    /* 0x74 : sf_ctrl_3 */
    union {
        struct {
            uint32_t sf_cmds_2_wrap_len   : 4; /* [ 3: 0],        r/w,        0x6 */
            uint32_t sf_cmds_2_en         : 1; /* [    4],        r/w,        0x1 */
            uint32_t sf_cmds_2_bt_dly     : 3; /* [ 7: 5],        r/w,        0x2 */
            uint32_t sf_cmds_2_bt_en      : 1; /* [    8],        r/w,        0x1 */
            uint32_t sf_cmds_2_wrap_q_ini : 1; /* [    9],        r/w,        0x0 */
            uint32_t sf_cmds_2_wrap_mode  : 2; /* [11:10],        r/w,        0x0 */
            uint32_t sf_cmds_2_wrap_q     : 1; /* [   12],          r,        0x0 */
            uint32_t sf_cmds_1_wrap_len   : 4; /* [16:13],        r/w,        0x6 */
            uint32_t sf_cmds_1_en         : 1; /* [   17],        r/w,        0x0 */
            uint32_t sf_cmds_1_wrap_mode  : 2; /* [19:18],        r/w,        0x0 */
            uint32_t sf_cmds_core_en      : 1; /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_28       : 8; /* [28:21],       rsvd,        0x0 */
            uint32_t sf_if_1_ack_lat      : 3; /* [31:29],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } sf_ctrl_3;

    /* 0x78 : sf_if_iahb_3 */
    union {
        struct {
            uint32_t reserved_0_11       : 12; /* [11: 0],       rsvd,        0x0 */
            uint32_t sf_if_2_dmy_byte    : 5;  /* [16:12],        r/w,        0x0 */
            uint32_t sf_if_2_adr_byte    : 3;  /* [19:17],        r/w,        0x2 */
            uint32_t sf_if_2_cmd_byte    : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t sf_if_2_dat_rw      : 1;  /* [   23],        r/w,        0x1 */
            uint32_t sf_if_2_dat_en      : 1;  /* [   24],        r/w,        0x1 */
            uint32_t sf_if_2_dmy_en      : 1;  /* [   25],        r/w,        0x0 */
            uint32_t sf_if_2_adr_en      : 1;  /* [   26],        r/w,        0x1 */
            uint32_t sf_if_2_cmd_en      : 1;  /* [   27],        r/w,        0x1 */
            uint32_t sf_if_2_spi_mode    : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t sf_if_2_qpi_mode_en : 1;  /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_3;

    /* 0x7C : sf_if_iahb_4 */
    union {
        struct {
            uint32_t sf_if_2_cmd_buf_0 : 32; /* [31: 0],        r/w, 0x38000000 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_4;

    /* 0x80 : sf_if_iahb_5 */
    union {
        struct {
            uint32_t sf_if_2_cmd_buf_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_5;

    /* 0x84 : sf_if_iahb_6 */
    union {
        struct {
            uint32_t reserved_0_16       : 17; /* [16: 0],       rsvd,        0x0 */
            uint32_t sf_if_3_adr_byte    : 3;  /* [19:17],        r/w,        0x0 */
            uint32_t sf_if_3_cmd_byte    : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23_25      : 3;  /* [25:23],       rsvd,        0x0 */
            uint32_t sf_if_3_adr_en      : 1;  /* [   26],        r/w,        0x0 */
            uint32_t sf_if_3_cmd_en      : 1;  /* [   27],        r/w,        0x1 */
            uint32_t sf_if_3_spi_mode    : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t sf_if_3_qpi_mode_en : 1;  /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_6;

    /* 0x88 : sf_if_iahb_7 */
    union {
        struct {
            uint32_t sf_if_3_cmd_buf_0 : 32; /* [31: 0],        r/w, 0xc0000000L */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_7;

    /* 0x8C : sf_if_iahb_8 */
    union {
        struct {
            uint32_t sf_if_3_cmd_buf_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_8;

    /* 0x90 : sf_if_iahb_9 */
    union {
        struct {
            uint32_t reserved_0_11       : 12; /* [11: 0],       rsvd,        0x0 */
            uint32_t sf_if_4_dmy_byte    : 5;  /* [16:12],        r/w,        0x2 */
            uint32_t sf_if_4_adr_byte    : 3;  /* [19:17],        r/w,        0x2 */
            uint32_t sf_if_4_cmd_byte    : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t sf_if_4_dat_rw      : 1;  /* [   23],        r/w,        0x0 */
            uint32_t sf_if_4_dat_en      : 1;  /* [   24],        r/w,        0x1 */
            uint32_t sf_if_4_dmy_en      : 1;  /* [   25],        r/w,        0x1 */
            uint32_t sf_if_4_adr_en      : 1;  /* [   26],        r/w,        0x1 */
            uint32_t sf_if_4_cmd_en      : 1;  /* [   27],        r/w,        0x1 */
            uint32_t sf_if_4_spi_mode    : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t sf_if_4_qpi_mode_en : 1;  /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_9;

