RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/sf_ctrl_reg.h
typedef volatile struct sf_if_sahb_0_reg sf_if_sahb_0_reg_t;

#define SF_CTRL_IF1_SAHB_OFFSET 0x8
#define SF_CTRL_IF2_SAHB_OFFSET 0xC8

/*Following is reg patch*/

/* 0x0 : if_io_dly_0 */
#define SF_CTRL_IO_DLY_0_OFFSET      (0x0)
#define SF_CTRL_CS_DLY_SEL           SF_CTRL_CS_DLY_SEL
#define SF_CTRL_CS_DLY_SEL_POS       (0U)
#define SF_CTRL_CS_DLY_SEL_LEN       (2U)
#define SF_CTRL_CS_DLY_SEL_MSK       (((1U << SF_CTRL_CS_DLY_SEL_LEN) - 1) << SF_CTRL_CS_DLY_SEL_POS)
#define SF_CTRL_CS_DLY_SEL_UMSK      (~(((1U << SF_CTRL_CS_DLY_SEL_LEN) - 1) << SF_CTRL_CS_DLY_SEL_POS))
#define SF_CTRL_CS2_DLY_SEL          SF_CTRL_CS2_DLY_SEL
#define SF_CTRL_CS2_DLY_SEL_POS      (2U)
#define SF_CTRL_CS2_DLY_SEL_LEN      (2U)
#define SF_CTRL_CS2_DLY_SEL_MSK      (((1U << SF_CTRL_CS2_DLY_SEL_LEN) - 1) << SF_CTRL_CS2_DLY_SEL_POS)
#define SF_CTRL_CS2_DLY_SEL_UMSK     (~(((1U << SF_CTRL_CS2_DLY_SEL_LEN) - 1) << SF_CTRL_CS2_DLY_SEL_POS))
#define SF_CTRL_CLK_OUT_DLY_SEL      SF_CTRL_CLK_OUT_DLY_SEL
#define SF_CTRL_CLK_OUT_DLY_SEL_POS  (8U)
#define SF_CTRL_CLK_OUT_DLY_SEL_LEN  (2U)
#define SF_CTRL_CLK_OUT_DLY_SEL_MSK  (((1U << SF_CTRL_CLK_OUT_DLY_SEL_LEN) - 1) << SF_CTRL_CLK_OUT_DLY_SEL_POS)
#define SF_CTRL_CLK_OUT_DLY_SEL_UMSK (~(((1U << SF_CTRL_CLK_OUT_DLY_SEL_LEN) - 1) << SF_CTRL_CLK_OUT_DLY_SEL_POS))
#define SF_CTRL_DQS_OE_DLY_SEL       SF_CTRL_DQS_OE_DLY_SEL
#define SF_CTRL_DQS_OE_DLY_SEL_POS   (26U)
#define SF_CTRL_DQS_OE_DLY_SEL_LEN   (2U)
#define SF_CTRL_DQS_OE_DLY_SEL_MSK   (((1U << SF_CTRL_DQS_OE_DLY_SEL_LEN) - 1) << SF_CTRL_DQS_OE_DLY_SEL_POS)
#define SF_CTRL_DQS_OE_DLY_SEL_UMSK  (~(((1U << SF_CTRL_DQS_OE_DLY_SEL_LEN) - 1) << SF_CTRL_DQS_OE_DLY_SEL_POS))
#define SF_CTRL_DQS_DI_DLY_SEL       SF_CTRL_DQS_DI_DLY_SEL
#define SF_CTRL_DQS_DI_DLY_SEL_POS   (28U)
#define SF_CTRL_DQS_DI_DLY_SEL_LEN   (2U)
#define SF_CTRL_DQS_DI_DLY_SEL_MSK   (((1U << SF_CTRL_DQS_DI_DLY_SEL_LEN) - 1) << SF_CTRL_DQS_DI_DLY_SEL_POS)
#define SF_CTRL_DQS_DI_DLY_SEL_UMSK  (~(((1U << SF_CTRL_DQS_DI_DLY_SEL_LEN) - 1) << SF_CTRL_DQS_DI_DLY_SEL_POS))
#define SF_CTRL_DQS_DO_DLY_SEL       SF_CTRL_DQS_DO_DLY_SEL
#define SF_CTRL_DQS_DO_DLY_SEL_POS   (30U)
#define SF_CTRL_DQS_DO_DLY_SEL_LEN   (2U)
#define SF_CTRL_DQS_DO_DLY_SEL_MSK   (((1U << SF_CTRL_DQS_DO_DLY_SEL_LEN) - 1) << SF_CTRL_DQS_DO_DLY_SEL_POS)
#define SF_CTRL_DQS_DO_DLY_SEL_UMSK  (~(((1U << SF_CTRL_DQS_DO_DLY_SEL_LEN) - 1) << SF_CTRL_DQS_DO_DLY_SEL_POS))

/* 0x4 : if_io_dly_1 */
#define SF_CTRL_IO_DLY_1_OFFSET      (0x4)
#define SF_CTRL_IO_0_OE_DLY_SEL      SF_CTRL_IO_0_OE_DLY_SEL
#define SF_CTRL_IO_0_OE_DLY_SEL_POS  (0U)
#define SF_CTRL_IO_0_OE_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_0_OE_DLY_SEL_MSK  (((1U << SF_CTRL_IO_0_OE_DLY_SEL_LEN) - 1) << SF_CTRL_IO_0_OE_DLY_SEL_POS)
#define SF_CTRL_IO_0_OE_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_0_OE_DLY_SEL_LEN) - 1) << SF_CTRL_IO_0_OE_DLY_SEL_POS))
#define SF_CTRL_IO_0_DI_DLY_SEL      SF_CTRL_IO_0_DI_DLY_SEL
#define SF_CTRL_IO_0_DI_DLY_SEL_POS  (8U)
#define SF_CTRL_IO_0_DI_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_0_DI_DLY_SEL_MSK  (((1U << SF_CTRL_IO_0_DI_DLY_SEL_LEN) - 1) << SF_CTRL_IO_0_DI_DLY_SEL_POS)
#define SF_CTRL_IO_0_DI_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_0_DI_DLY_SEL_LEN) - 1) << SF_CTRL_IO_0_DI_DLY_SEL_POS))
#define SF_CTRL_IO_0_DO_DLY_SEL      SF_CTRL_IO_0_DO_DLY_SEL
#define SF_CTRL_IO_0_DO_DLY_SEL_POS  (16U)
#define SF_CTRL_IO_0_DO_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_0_DO_DLY_SEL_MSK  (((1U << SF_CTRL_IO_0_DO_DLY_SEL_LEN) - 1) << SF_CTRL_IO_0_DO_DLY_SEL_POS)
#define SF_CTRL_IO_0_DO_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_0_DO_DLY_SEL_LEN) - 1) << SF_CTRL_IO_0_DO_DLY_SEL_POS))

/* 0x8 : if_io_dly_2 */
#define SF_CTRL_IO_DLY_2_OFFSET      (0x8)
#define SF_CTRL_IO_1_OE_DLY_SEL      SF_CTRL_IO_1_OE_DLY_SEL
#define SF_CTRL_IO_1_OE_DLY_SEL_POS  (0U)
#define SF_CTRL_IO_1_OE_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_1_OE_DLY_SEL_MSK  (((1U << SF_CTRL_IO_1_OE_DLY_SEL_LEN) - 1) << SF_CTRL_IO_1_OE_DLY_SEL_POS)
#define SF_CTRL_IO_1_OE_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_1_OE_DLY_SEL_LEN) - 1) << SF_CTRL_IO_1_OE_DLY_SEL_POS))
#define SF_CTRL_IO_1_DI_DLY_SEL      SF_CTRL_IO_1_DI_DLY_SEL
#define SF_CTRL_IO_1_DI_DLY_SEL_POS  (8U)
#define SF_CTRL_IO_1_DI_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_1_DI_DLY_SEL_MSK  (((1U << SF_CTRL_IO_1_DI_DLY_SEL_LEN) - 1) << SF_CTRL_IO_1_DI_DLY_SEL_POS)
#define SF_CTRL_IO_1_DI_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_1_DI_DLY_SEL_LEN) - 1) << SF_CTRL_IO_1_DI_DLY_SEL_POS))
#define SF_CTRL_IO_1_DO_DLY_SEL      SF_CTRL_IO_1_DO_DLY_SEL
#define SF_CTRL_IO_1_DO_DLY_SEL_POS  (16U)
#define SF_CTRL_IO_1_DO_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_1_DO_DLY_SEL_MSK  (((1U << SF_CTRL_IO_1_DO_DLY_SEL_LEN) - 1) << SF_CTRL_IO_1_DO_DLY_SEL_POS)
#define SF_CTRL_IO_1_DO_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_1_DO_DLY_SEL_LEN) - 1) << SF_CTRL_IO_1_DO_DLY_SEL_POS))

/* 0xc : if_io_dly_3 */
#define SF_CTRL_IO_DLY_3_OFFSET      (0xc)
#define SF_CTRL_IO_2_OE_DLY_SEL      SF_CTRL_IO_2_OE_DLY_SEL
#define SF_CTRL_IO_2_OE_DLY_SEL_POS  (0U)
#define SF_CTRL_IO_2_OE_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_2_OE_DLY_SEL_MSK  (((1U << SF_CTRL_IO_2_OE_DLY_SEL_LEN) - 1) << SF_CTRL_IO_2_OE_DLY_SEL_POS)
#define SF_CTRL_IO_2_OE_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_2_OE_DLY_SEL_LEN) - 1) << SF_CTRL_IO_2_OE_DLY_SEL_POS))
#define SF_CTRL_IO_2_DI_DLY_SEL      SF_CTRL_IO_2_DI_DLY_SEL
#define SF_CTRL_IO_2_DI_DLY_SEL_POS  (8U)
#define SF_CTRL_IO_2_DI_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_2_DI_DLY_SEL_MSK  (((1U << SF_CTRL_IO_2_DI_DLY_SEL_LEN) - 1) << SF_CTRL_IO_2_DI_DLY_SEL_POS)
#define SF_CTRL_IO_2_DI_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_2_DI_DLY_SEL_LEN) - 1) << SF_CTRL_IO_2_DI_DLY_SEL_POS))
#define SF_CTRL_IO_2_DO_DLY_SEL      SF_CTRL_IO_2_DO_DLY_SEL
#define SF_CTRL_IO_2_DO_DLY_SEL_POS  (16U)
#define SF_CTRL_IO_2_DO_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_2_DO_DLY_SEL_MSK  (((1U << SF_CTRL_IO_2_DO_DLY_SEL_LEN) - 1) << SF_CTRL_IO_2_DO_DLY_SEL_POS)
#define SF_CTRL_IO_2_DO_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_2_DO_DLY_SEL_LEN) - 1) << SF_CTRL_IO_2_DO_DLY_SEL_POS))

/* 0x10 : if_io_dly_4 */
#define SF_CTRL_IO_DLY_4_OFFSET      (0x10)
#define SF_CTRL_IO_3_OE_DLY_SEL      SF_CTRL_IO_3_OE_DLY_SEL
#define SF_CTRL_IO_3_OE_DLY_SEL_POS  (0U)
#define SF_CTRL_IO_3_OE_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_3_OE_DLY_SEL_MSK  (((1U << SF_CTRL_IO_3_OE_DLY_SEL_LEN) - 1) << SF_CTRL_IO_3_OE_DLY_SEL_POS)
#define SF_CTRL_IO_3_OE_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_3_OE_DLY_SEL_LEN) - 1) << SF_CTRL_IO_3_OE_DLY_SEL_POS))
#define SF_CTRL_IO_3_DI_DLY_SEL      SF_CTRL_IO_3_DI_DLY_SEL
#define SF_CTRL_IO_3_DI_DLY_SEL_POS  (8U)
#define SF_CTRL_IO_3_DI_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_3_DI_DLY_SEL_MSK  (((1U << SF_CTRL_IO_3_DI_DLY_SEL_LEN) - 1) << SF_CTRL_IO_3_DI_DLY_SEL_POS)
#define SF_CTRL_IO_3_DI_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_3_DI_DLY_SEL_LEN) - 1) << SF_CTRL_IO_3_DI_DLY_SEL_POS))
#define SF_CTRL_IO_3_DO_DLY_SEL      SF_CTRL_IO_3_DO_DLY_SEL
#define SF_CTRL_IO_3_DO_DLY_SEL_POS  (16U)
#define SF_CTRL_IO_3_DO_DLY_SEL_LEN  (2U)
#define SF_CTRL_IO_3_DO_DLY_SEL_MSK  (((1U << SF_CTRL_IO_3_DO_DLY_SEL_LEN) - 1) << SF_CTRL_IO_3_DO_DLY_SEL_POS)
#define SF_CTRL_IO_3_DO_DLY_SEL_UMSK (~(((1U << SF_CTRL_IO_3_DO_DLY_SEL_LEN) - 1) << SF_CTRL_IO_3_DO_DLY_SEL_POS))

struct sf_if_io_dly_0_reg {
    /* 0x0 : if_io_dly_0 */
    union {
        struct {
            uint32_t cs_dly_sel      : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t cs2_dly_sel     : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reserved_4_7    : 4;  /* [ 7: 4],       rsvd,        0x0 */
            uint32_t clk_out_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_25  : 16; /* [25:10],       rsvd,        0x0 */
            uint32_t dqs_oe_dly_sel  : 2;  /* [27:26],        r/w,        0x0 */
            uint32_t dqs_di_dly_sel  : 2;  /* [29:28],        r/w,        0x0 */
            uint32_t dqs_do_dly_sel  : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } io_dly_0;

    /* 0x4 : if_io_dly_1 */
    union {
        struct {
            uint32_t io_0_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7    : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t io_0_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15  : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t io_0_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31  : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } io_dly_1;

    /* 0x8 : if_io_dly_2 */
    union {
        struct {
            uint32_t io_1_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7    : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t io_1_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15  : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t io_1_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31  : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } io_dly_2;

    /* 0xc : if_io_dly_3 */
    union {
        struct {
            uint32_t io_2_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7    : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t io_2_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15  : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t io_2_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31  : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } io_dly_3;

